<a href="https://colab.research.google.com/github/AngelicaDC/BEDUpython/blob/main/Sesion-08/conexion_importaciontab.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Ejemplo 1: Conectándose a una base de datos remota

### 1. Objetivos:
    - Usar `mysql-connector-python` para conectarse a una base de datos remota.
 
---
    
### 2. Desarrollo:

In [3]:
!pip install mysql-connector-python

Requirement already satisfied: mysql-connector-python in /usr/local/lib/python3.7/dist-packages (8.0.26)
Requirement already satisfied: protobuf>=3.0.0 in /usr/local/lib/python3.7/dist-packages (from mysql-connector-python) (3.17.3)
Requirement already satisfied: six>=1.9 in /usr/local/lib/python3.7/dist-packages (from protobuf>=3.0.0->mysql-connector-python) (1.15.0)

#### a) Realizar una conexión y el `cursor`

Para conectarnos necesitamos primero importar la librería:

In [16]:
import mysql.connector

Después necesitamos saber la siguiente información acerca de la instancia de MySQL a la que queremos conectarnos:

1. Host
2. Puerto
3. Usuario
4. Contraseña
5. Base de datos a la que queremos conectarnos (recuerda que MySQL **no** es una base de datos, es un Sistema de Gestión de Bases de Datos; es decir, es software que nos ayuda a organizar bases de datos para que sean de fácil acceso)

Todos esos datos los usamos para crear una conexión:

In [15]:
# Llenar esta información con los datos que te compartan los ingenieros de Bedu

cnx = mysql.connector.connect(
    host="ec2-34-222-235-52.us-west-2.compute.amazonaws.com",
    port=3306,
    user="data",
    password='khQ9--mp6LWq97iA',
    database='movielens'
)

Ahora, para poder realizar lecturas a nuestra base de datos, tenemos que crear un objeto llamado `cursor`:

In [17]:
cursor = cnx.cursor()

In [18]:
type(cursor)

mysql.connector.cursor_cext.CMySQLCursor

Éste objeto lo podemos usar para realizar cualquier consulta en lenguaje SQL. Por ejemplo, veamos qué tablas existen en nuestra base de datos:

In [19]:
cursor.execute("SHOW TABLES")

Después de ejecutar el comando, tenemos que extraer la información de esta manera:

In [20]:
result = cursor.fetchall()

In [21]:
result

[('age_ranges',), ('movies',), ('occupations',), ('ratings',), ('users',)]

Listo. Sabemos que tenemos 5 tablas en nuestra base de datos.

Por último, es importante cerrar nuestro `cursor` para no utilizar memoria extra en nuestra computadora:

In [12]:
cursor.close()

True

In [22]:
import pandas as pd

In [ ]:
query = "INSERT INTO nombrecitos (col1, col2) VALUES (%s, %s)"
data = [
        ("rafael", "arias"),
        ("angelica", "dominguez")]

In [40]:
cursor = cnx.cursor()
cursor.execute("SELECT * FROM users")
result = cursor.fetchall()
df_users = pd.DataFrame(result, columns=['user_id', 'gender', 'age', 'occupation', 'cp'])

cursor.execute("SELECT * FROM movies")
result = cursor.fetchall()
df_movies = pd.DataFrame(result, columns=['movie_id', 'title', 'genres'])

cursor.execute("SELECT * FROM ratings")
result = cursor.fetchall()
df_ratings = pd.DataFrame(result, columns=['user_id', 'movie_id', 'rating', 'timestamp'])

cursor.execute("SELECT * FROM occupations")
result = cursor.fetchall()
df_occupations = pd.DataFrame(result, columns=['occupation_id', 'description'])

cursor.execute("SELECT * FROM age_ranges")
result = cursor.fetchall()
df_age_ranges = pd.DataFrame(result, columns=['age_id', 'age_range'])

cursor.close()

True

In [41]:
df_users = df_users.set_index('user_id', drop=True)
df_users

        gender  age  occupation     cp
user_id
1            F    1          10  48067
2            M   56          16  70072
3            M   25          15  55117
4            M   45           7  02460
5            M   25          20  55455
...        ...  ...         ...    ...
6036         F   25          15  32603
6037         F   45           1  76006
6038         F   56           1  14706
6039         F   45           0  01060
6040         M   25           6  11106

[6040 rows x 4 columns]

In [42]:
df_movies = df_movies.set_index('movie_id', drop=True)
df_movies

                                       title                        genres
movie_id
1                           Toy Story (1995)   Animation|Children's|Comedy
2                             Jumanji (1995)  Adventure|Children's|Fantasy
3                    Grumpier Old Men (1995)                Comedy|Romance
4                   Waiting to Exhale (1995)                  Comedy|Drama
5         Father of the Bride Part II (1995)                        Comedy
...                                      ...                           ...
3948                 Meet the Parents (2000)                        Comedy
3949              Requiem for a Dream (2000)                         Drama
3950                        Tigerland (2000)                         Drama
3951                 Two Family House (2000)                         Drama
3952                   Contender, The (2000)                Drama|Thriller

[3883 rows x 2 columns]

In [43]:
df_occupations = df_occupations.set_index('occupation_id', drop=True)
df_occupations

                          description
occupation_id
0              other or not specified
1                   academic/educator
2                              artist
3                      clerical/admin
4                college/grad student
5                    customer service
6                  doctor/health care
7                executive/managerial
8                              farmer
9                           homemaker
10                       K-12 student
11                             lawyer
12                         programmer
13                            retired
14                    sales/marketing
15                          scientist
16                      self-employed
17                technician/engineer
18                tradesman/craftsman
19                         unemployed
20                             writer

In [44]:
df_age_ranges = df_age_ranges.set_index('age_id', drop=True)
df_age_ranges

       age_range
age_id
1       Under 18
18         18-24
25         25-34
35         35-44
45         45-49
50         50-55
56           56+